import WeightedNetKAT.Examples.Common
import WeightedNetKAT.WNKA

namespace WeightedNetKAT

open Fields

/--
info: ({(♡, ⊤)},
 [],
 [(![0, 0], ![0, 0], {(♡, ⊤)}),
  (![0, 1], ![0, 1], {(♡, ⊤)}),
  (![1, 0], ![1, 0], {(♡, ⊤)}),
  (![1, 1], ![1, 1], {(♡, ⊤)})])
-/
#guard_msgs in
#wnka_eval[Fin 2, Fin 2, Bottleneck ℕ∞] { skip }

/--
info: ({(ll♡, ⊤), (lrl♡, ⊤), (lrrl♡, ⊤), (lrrrl♡, ⊤), (lrrrr♡, ⊤)},
 [],
 [([(dst, 0), (pt, 0), (sw, 0)], [(dst, 0), (pt, 0), (sw, 1)], {(rlll♡, ⊤), (rllr♡, ⊤), (rlrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 0), (sw, 0)], [(dst, 0), (pt, 1), (sw, 1)], {(rlrrlr♡, ⊤), (rlrrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 0), (sw, 0)], [(dst, 1), (pt, 0), (sw, 1)], {(rlrlr♡, ⊤), (rlrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 0), (sw, 0)], [(dst, 1), (pt, 1), (sw, 1)], {(rlrrrlr♡, ⊤), (rlrrrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 0), (sw, 1)], [(dst, 0), (pt, 0), (sw, 1)], {(rllr♡, ⊤), (rlrrrrll♡, ⊤), (rlrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 0), (sw, 1)], [(dst, 0), (pt, 1), (sw, 1)], {(rlrrlr♡, ⊤), (rlrrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 0), (sw, 1)], [(dst, 1), (pt, 0), (sw, 1)], {(rlrlr♡, ⊤), (rlrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 0), (sw, 1)], [(dst, 1), (pt, 1), (sw, 1)], {(rlrrrlr♡, ⊤), (rlrrrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 1), (sw, 0)], [(dst, 0), (pt, 0), (sw, 1)], {(rllr♡, ⊤), (rlrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 1), (sw, 0)],
   [(dst, 0), (pt, 1), (sw, 1)],
   {(ll♡, 2), (rlrrll♡, ⊤), (rlrrlr♡, ⊤), (rlrrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 1), (sw, 0)], [(dst, 1), (pt, 0), (sw, 1)], {(rlrlr♡, ⊤), (rlrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 1), (sw, 0)], [(dst, 1), (pt, 1), (sw, 1)], {(rlrrrlr♡, ⊤), (rlrrrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 1), (sw, 1)], [(dst, 0), (pt, 0), (sw, 1)], {(rllr♡, ⊤), (rlrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 1), (sw, 1)],
   [(dst, 0), (pt, 1), (sw, 1)],
   {(lrrl♡, 2), (rlrrlr♡, ⊤), (rlrrrrrrll♡, ⊤), (rlrrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 1), (sw, 1)], [(dst, 1), (pt, 0), (sw, 1)], {(rlrlr♡, ⊤), (rlrrrrrlr♡, ⊤)}),
  ([(dst, 0), (pt, 1), (sw, 1)], [(dst, 1), (pt, 1), (sw, 1)], {(rlrrrlr♡, ⊤), (rlrrrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 0), (sw, 0)], [(dst, 0), (pt, 0), (sw, 1)], {(rllr♡, ⊤), (rlrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 0), (sw, 0)], [(dst, 0), (pt, 1), (sw, 1)], {(rlrrlr♡, ⊤), (rlrrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 0), (sw, 0)], [(dst, 1), (pt, 0), (sw, 1)], {(rlrll♡, ⊤), (rlrlr♡, ⊤), (rlrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 0), (sw, 0)], [(dst, 1), (pt, 1), (sw, 1)], {(rlrrrlr♡, ⊤), (rlrrrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 0), (sw, 1)], [(dst, 0), (pt, 0), (sw, 1)], {(rllr♡, ⊤), (rlrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 0), (sw, 1)], [(dst, 0), (pt, 1), (sw, 1)], {(rlrrlr♡, ⊤), (rlrrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 0), (sw, 1)], [(dst, 1), (pt, 0), (sw, 1)], {(rlrlr♡, ⊤), (rlrrrrrll♡, ⊤), (rlrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 0), (sw, 1)], [(dst, 1), (pt, 1), (sw, 1)], {(rlrrrlr♡, ⊤), (rlrrrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 1), (sw, 0)], [(dst, 0), (pt, 0), (sw, 1)], {(rllr♡, ⊤), (rlrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 1), (sw, 0)], [(dst, 0), (pt, 1), (sw, 1)], {(rlrrlr♡, ⊤), (rlrrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 1), (sw, 0)], [(dst, 1), (pt, 0), (sw, 1)], {(rlrlr♡, ⊤), (rlrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 1), (sw, 0)],
   [(dst, 1), (pt, 1), (sw, 1)],
   {(lrl♡, 2), (rlrrrll♡, ⊤), (rlrrrlr♡, ⊤), (rlrrrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 1), (sw, 1)], [(dst, 0), (pt, 0), (sw, 1)], {(rllr♡, ⊤), (rlrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 1), (sw, 1)], [(dst, 0), (pt, 1), (sw, 1)], {(rlrrlr♡, ⊤), (rlrrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 1), (sw, 1)], [(dst, 1), (pt, 0), (sw, 1)], {(rlrlr♡, ⊤), (rlrrrrrlr♡, ⊤)}),
  ([(dst, 1), (pt, 1), (sw, 1)],
   [(dst, 1), (pt, 1), (sw, 1)],
   {(lrrrl♡, 2), (rlrrrlr♡, ⊤), (rlrrrrrrrll♡, ⊤), (rlrrrrrrrlr♡, ⊤)})])
-/
#guard_msgs in
#wnka_eval'[Fields, Fin 2, Bottleneck ℕ∞] {
  if pt = 3 then ~2 ⨀ sw ← 3 else drop
  -- if pt = 4 then ~4 ⨀ sw ← 4 else drop
}

/-- info: ({(l♡, ⊤), (r♡, ⊤)}, [], [(![0, 0], ![0, 0], {(l♡, ⊤)})]) -/
#guard_msgs in
#wnka_eval'[Fin 2, Fin 1, Bottleneck ℕ∞] { ~1 = ~1 }

/--
info: ({(♡, ⊤)},
 [(![0, 0], ![0, 0], {((♡, ♣), ⊤)}),
  (![0, 1], ![0, 1], {((♡, ♣), ⊤)}),
  (![1, 0], ![1, 0], {((♡, ♣), ⊤)}),
  (![1, 1], ![1, 1], {((♡, ♣), ⊤)})],
 [(![0, 0], ![0, 0], {(♣, ⊤)}),
  (![0, 1], ![0, 1], {(♣, ⊤)}),
  (![1, 0], ![1, 0], {(♣, ⊤)}),
  (![1, 1], ![1, 1], {(♣, ⊤)})])
-/
#guard_msgs in
#wnka_eval[Fin 2, Fin 2, Bottleneck ℕ∞] { dup }

/--
info: ({(♡, 10)},
 [(![0, 0], ![0, 0], {((♡, ♣), ⊤)}),
  (![0, 1], ![0, 1], {((♡, ♣), ⊤)}),
  (![1, 0], ![1, 0], {((♡, ♣), ⊤)}),
  (![1, 1], ![1, 1], {((♡, ♣), ⊤)})],
 [(![0, 0], ![0, 0], {(♣, ⊤)}),
  (![0, 1], ![0, 1], {(♣, ⊤)}),
  (![1, 0], ![1, 0], {(♣, ⊤)}),
  (![1, 1], ![1, 1], {(♣, ⊤)})])
-/
#guard_msgs in
#wnka_eval[Fin 2, Fin 2, Bottleneck ℕ∞] { ~10 ⨀ dup }

/--
info: ({(l♡, ⊤)},
 [(![0, 0], ![0, 0], {((l♡, r♣), 10), ((r♡, r♣), ⊤)}),
  (![0, 1], ![0, 1], {((l♡, r♣), 10), ((r♡, r♣), ⊤)}),
  (![1, 0], ![1, 0], {((l♡, r♣), 10), ((r♡, r♣), ⊤)}),
  (![1, 1], ![1, 1], {((l♡, r♣), 10), ((r♡, r♣), ⊤)})],
 [(![0, 0], ![0, 0], {(r♣, ⊤)}),
  (![0, 1], ![0, 1], {(r♣, ⊤)}),
  (![1, 0], ![1, 0], {(r♣, ⊤)}),
  (![1, 1], ![1, 1], {(r♣, ⊤)})])
-/
#guard_msgs in
#wnka_eval[Fin 2, Fin 2, Bottleneck ℕ∞] { skip ; ~10 ⨀ dup }

/--
info: ({(♡, ⊤)},
 [],
 [(![0, 0], ![1, 0], {(♡, ⊤)}),
  (![0, 1], ![1, 0], {(♡, ⊤)}),
  (![1, 0], ![1, 0], {(♡, ⊤)}),
  (![1, 1], ![1, 0], {(♡, ⊤)})])
-/
#guard_msgs in
#wnka_eval[Fin 2, Fin 2, Bottleneck ℕ∞] { @mod ~pk[0 ↦ 1] }

/--
info: ({(l♡, ⊤), (r♡, ⊤)},
 [],
 [(![0, 0], ![0, 1], {(r♡, ⊤)}),
  (![0, 0], ![1, 0], {(l♡, ⊤)}),
  (![0, 1], ![0, 1], {(r♡, ⊤)}),
  (![0, 1], ![1, 0], {(l♡, ⊤)}),
  (![1, 0], ![0, 1], {(r♡, ⊤)}),
  (![1, 0], ![1, 0], {(l♡, ⊤)}),
  (![1, 1], ![0, 1], {(r♡, ⊤)}),
  (![1, 1], ![1, 0], {(l♡, ⊤)})])
-/
#guard_msgs in
#wnka_eval[Fin 2, Fin 2, Bottleneck ℕ∞] { @mod ~pk[0 ↦ 1] ⨁ @mod ~pk[1 ↦ 1] }

/--
info: ({(ll♡, ⊤), (lr♡, ⊤)},
 [(![0, 0], ![0, 0], {((rl♡, rl♣), ⊤)}),
  (![0, 0], ![0, 1], {((lr♡, rl♣), ⊤)}),
  (![0, 0], ![1, 0], {((ll♡, rl♣), ⊤)}),
  (![0, 1], ![0, 1], {((lr♡, rl♣), ⊤), ((rl♡, rl♣), ⊤)}),
  (![0, 1], ![1, 0], {((ll♡, rl♣), ⊤)}),
  (![1, 0], ![0, 1], {((lr♡, rl♣), ⊤)}),
  (![1, 0], ![1, 0], {((ll♡, rl♣), ⊤), ((rl♡, rl♣), ⊤)}),
  (![1, 1], ![0, 1], {((lr♡, rl♣), ⊤)}),
  (![1, 1], ![1, 0], {((ll♡, rl♣), ⊤)}),
  (![1, 1], ![1, 1], {((rl♡, rl♣), ⊤)})],
 [(![1, 0], ![1, 0], {(rl♣, ⊤), (rr♡, ⊤)})])
-/
#guard_msgs in
#wnka_eval[Fin 2, Fin 2, Bottleneck ℕ∞] {
  (@mod ~pk[0 ↦ 1] ⨁ @mod ~pk[1 ↦ 1]) ; dup ; @test ~pk[0 ↦ 1]
}

/--
info: ({(l♡, ⊤)},
 [(![0, 0], ![0, 0], {((l♡, rll♣), ⊤), ((rll♡, rll♣), ⊤)}),
  (![0, 1], ![0, 1], {((l♡, rll♣), ⊤), ((rll♡, rll♣), ⊤)}),
  (![1, 0], ![1, 0], {((l♡, rll♣), ⊤), ((rll♡, rll♣), ⊤)}),
  (![1, 1], ![1, 1], {((l♡, rll♣), ⊤), ((rll♡, rll♣), ⊤)})],
 [(![0, 0], ![0, 0], {(rll♣, 1), (rlrr♡, ⊤), (rrl♡, ⊤), (rrrl♡, ⊤), (rrrr♡, ⊤)})])
-/
#guard_msgs in
#wnka_eval[Fin 2, Fin 2, Bottleneck ℕ∞] { skip; (dup; @mod ~pk[0 ↦ 1] ⨁ ~1 ⨀ skip); skip; skip; @test ~pk[0 ↦ 0] }

end WeightedNetKAT
